testsuite/surfaceTension/S1_Ma633/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       119300;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       119400;
    }
    sym
    {
        type            empty;
        inGroups        1(empty);
        nFaces          120000;
        startFace       119500;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       239500;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       240100;
    }
)

// ************************************************************************* //
