testsuite/surfaceTension/S1_Ma633/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    specie
    {
        molWeight   18;// i dont think this actually does anything to the solution its calculated for the mixture
                        //but if theres only one species nothing happens.
    }
    equationOfState
    {
        rho 1;
    }
    thermodynamics
    {
            Cp     3103.953; //J/kg/K
            Hf              0; //h = cp*T + Hf
            //liquid is at ref state, Hf=0
    }
    transport
    {
        mu          1.366e-4;
        Pr          4.24;
    }
}

// ************************************************************************* //
