testsuite/surfaceTension/S1_Ma633/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler; //CoEuler CrankNicolson Euler SLTS backward bounded localEuler steadyState)
}

gradSchemes
{
    default         cellLimited Gauss linear 0.5;
}

divSchemes
{
    default         Gauss QUICK;

    div(rhoPhi,U)   Gauss MUSCL;
    div(rhoPhi,T)   Gauss MUSCL;

    div(phi,alpha)  Gauss MUSCL; //interface interpolation scheme
    // div(phirb,alpha) Gauss linear;

    // div(phi,p)      Gauss upwind;
    // div(rhoPhi,K)   Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    // div(rhoCpPhi,T)       Gauss upwind;
    // div((interpolate(cp)*rhoPhi),T) Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
