testsuite/surfaceTension/S1_Ma633/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaSubCycles 4;
        nAlphaCorr      2; //no idea, solver wants it
        cAlpha          1;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-05;
            relTol          0;
            smoother        GaussSeidel;
        }
        tolerance       1e-05;
        relTol          0;
        maxIter         100;
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.05;
        smoother        GaussSeidel;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-06;
            relTol          0;
            nVcycles        2;
            smoother        GaussSeidel;
        }
        tolerance       1e-06;
        relTol          0;
        maxIter         20;
    }
  "T.*"
      {
          solver          smoothSolver;
          smoother        symGaussSeidel;
          tolerance       1e-06; //no gradients, isothermal case
          relTol          0.025;
      }
    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-09;
        relTol          0.1;
        nSweeps         2;
    }

    UFinal
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2; //if 1, operates in PISO mode or SIMPLE mode
    //if ddt scheme is steady state, and nCorrectors is 1, SIMPLE is used
    // consistent true ; this enables SIMPLEC if using SIMPLE

    nNonOrthogonalCorrectors 0;
    pRefCell    1;
    pRefValue    101325;//only matters for incompressible solvers, NOT cmiFoam
}

relaxationFactors
{
    equations
    {
        ".*"            1; //if using SIMPLE, must be less than 1
    }
}

// ************************************************************************* //
